---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.PressureDrop
source: html/d24084b4-7305-029a-1931-d8c6f3905951.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.PressureDrop Property

The calculated pressure drop of this segment, in kg/(ft*s^2).

## Syntax (C#)
```csharp
public double PressureDrop { get; }
```